:PROPERTIES:
:ID:       8574FAEF-1D66-43C5-820C-CE62A54143BF
:END:
#+title: JavaScript Variable const


* [[id:B178F57B-461C-4AF3-A52E-941A3D72571F][JavaScript]] 
* const

- Introduced in ES2015
- The most strict way to *declare* a variable.
- More strict
- Much more organized 
- *Value cannot change*
- Limited to the scope it's declared in
- Must initialize and assign at declaration
- Use const type whenever possble, to make code more secure and readable
- 
- 



#+begin_src js :results output

  const name = "Wally";
  console.log(name);

  // Object
  const Person = {
      name: "Dennis",
      age: 53
      }

  console.log(Person);
  console.log(Person.name);
  console.log(typeof(Person));

  // Arrays
  const numbers = [1,2,3,4,5];
  numbers.push(6);

  console.log(numbers);
  console.log(numbers[4]);



#+end_src

#+RESULTS:
: Wally
: { name: 'Dennis', age: 53 }
: Dennis
: object
: [ 1, 2, 3, 4, 5, 6 ]
: 5

